In [3]:
import pandas as pd

In [38]:
bioclass = {'Name':['Rukayat','Samson','Ifeoluwa','Boluwatife','Omolola',
                'Olubunmi','Ademola'],
                'Score':[98,89,99,87,90,83,99],
                'Gender':['Female','Male','Female','Female','Female',
                         'Female','Male']
               }
students = pd.DataFrame(bioclass)
students

         Name  Score  Gender
0     Rukayat     98  Female
1      Samson     89    Male
2    Ifeoluwa     99  Female
3  Boluwatife     87  Female
4     Omolola     90  Female
5    Olubunmi     83  Female
6     Ademola     99    Male

1. Find The First 3 Rows of The Dataset

In [39]:
students.head(3)

       Name  Score  Gender
0   Rukayat     98  Female
1    Samson     89    Male
2  Ifeoluwa     99  Female

2. Find The Last 4 Rows of The Dataset

In [40]:
students.tail(4)

         Name  Score  Gender
3  Boluwatife     87  Female
4     Omolola     90  Female
5    Olubunmi     83  Female
6     Ademola     99    Male

3. Find The Shape of The Dataset (No. of Rows & No. of Columns)

In [6]:
students.shape

(7, 3)

In [41]:
print('Number of Rows is', students.shape[0])
print('Number of Columns is', students.shape[1])

Number of Rows is 7
Number of Columns is 3

4. Information About The Dataset

In [42]:
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Score   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

5. Find Null Values in The Dataset

In [43]:
students.isnull().sum()

Name      0
Score     0
Gender    0
dtype: int64

6. Overall Statistics of The DataFrame

In [44]:
students.describe()
students.describe(include='all')

           Name      Score  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Rukayat        NaN  Female
freq          1        NaN       5
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

7. Find Unique Values from the gender column

In [45]:
students['Gender'].unique()

array(['Female', 'Male'], dtype=object)

8. Find Number of Unique Values from the gender column

In [46]:
students['Gender'].nunique()

2

9. Display Count of unique values in the gender column

In [47]:
students['Gender'].value_counts()

Female    5
Male      2
Name: Gender, dtype: int64

10. Find total number to students having marks between 90 - 100 (inclusive)

In [48]:
students['Score'] >= 90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Score, dtype: bool

In [49]:
students[students['Score'] >= 90]

       Name  Score  Gender
0   Rukayat     98  Female
2  Ifeoluwa     99  Female
4   Omolola     90  Female
6   Ademola     99    Male

In [50]:
(students['Score'] >= 90) & (students['Score'] <= 100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Score, dtype: bool

In [51]:
students[(students['Score'] >= 90) & (students['Score'] <= 100)]

       Name  Score  Gender
0   Rukayat     98  Female
2  Ifeoluwa     99  Female
4   Omolola     90  Female
6   Ademola     99    Male

In [52]:
len(students[(students['Score'] >= 90) & (students['Score'] <= 100)])

4

In [53]:
students["Score"].between(90, 100).sum()

4

11. Find Average, Min & Max of Marks

In [54]:
students['Score'].mean()

92.14285714285714

In [55]:
students['Score'].min()

83

In [56]:
students['Score'].max()

99

12. Find half of mark using Apply Method and create a new column for it

In [58]:
def score(x):
    return x/2

In [59]:
students["Score"].apply(score)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Score, dtype: float64

In [74]:
students["Half Score"] = students["Score"].apply(score)
students

         Name  Score  Gender  Half Score
0     Rukayat     98  Female        49.0
1      Samson     89    Male        44.5
2    Ifeoluwa     99  Female        49.5
3  Boluwatife     87  Female        43.5
4     Omolola     90  Female        45.0
5    Olubunmi     83  Female        41.5
6     Ademola     99    Male        49.5

In [61]:
students['Score'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Score, dtype: float64

In [62]:
students["Name"].apply(len)

0     7
1     6
2     8
3    10
4     7
5     8
6     7
Name: Name, dtype: int64

13. Map Function

In [63]:
students

         Name  Score  Gender  Half Score
0     Rukayat     98  Female        49.0
1      Samson     89    Male        44.5
2    Ifeoluwa     99  Female        49.5
3  Boluwatife     87  Female        43.5
4     Omolola     90  Female        45.0
5    Olubunmi     83  Female        41.5
6     Ademola     99    Male        49.5

In [75]:
students['Gender No.'] = students["Gender"].map({'Male':0, 'Female':1})

In [67]:
students

         Name  Score  Gender  Half Score  Gender No.
0     Rukayat     98  Female        49.0           1
1      Samson     89    Male        44.5           0
2    Ifeoluwa     99  Female        49.5           1
3  Boluwatife     87  Female        43.5           1
4     Omolola     90  Female        45.0           1
5    Olubunmi     83  Female        41.5           1
6     Ademola     99    Male        49.5           0

14. Drop the Column(s)

In [76]:
students.drop(["Half Score", "Gender No."], axis=1, inplace=True)
students

         Name  Score  Gender
0     Rukayat     98  Female
1      Samson     89    Male
2    Ifeoluwa     99  Female
3  Boluwatife     87  Female
4     Omolola     90  Female
5    Olubunmi     83  Female
6     Ademola     99    Male

15. Print Name of The Columns

In [77]:
students.columns

Index(['Name', 'Score', 'Gender'], dtype='object')

In [78]:
students.index

RangeIndex(start=0, stop=7, step=1)

16. Sort the DataFrame by the Score Column

In [79]:
students

         Name  Score  Gender
0     Rukayat     98  Female
1      Samson     89    Male
2    Ifeoluwa     99  Female
3  Boluwatife     87  Female
4     Omolola     90  Female
5    Olubunmi     83  Female
6     Ademola     99    Male

In [83]:
students.sort_values(by=['Score'], ascending=False)

         Name  Score  Gender
2    Ifeoluwa     99  Female
6     Ademola     99    Male
0     Rukayat     98  Female
4     Omolola     90  Female
1      Samson     89    Male
3  Boluwatife     87  Female
5    Olubunmi     83  Female

In [82]:
students.sort_values(by=['Score', 'Gender'], ascending=False)

         Name  Score  Gender
6     Ademola     99    Male
2    Ifeoluwa     99  Female
0     Rukayat     98  Female
4     Omolola     90  Female
1      Samson     89    Male
3  Boluwatife     87  Female
5    Olubunmi     83  Female

17. Display Name & Score of the Female Students

In [84]:
students

         Name  Score  Gender
0     Rukayat     98  Female
1      Samson     89    Male
2    Ifeoluwa     99  Female
3  Boluwatife     87  Female
4     Omolola     90  Female
5    Olubunmi     83  Female
6     Ademola     99    Male

In [87]:
students[students['Gender'] == 'Female'] [['Name', 'Score']]

         Name  Score
0     Rukayat     98
2    Ifeoluwa     99
3  Boluwatife     87
4     Omolola     90
5    Olubunmi     83

In [89]:
students[students['Gender'].isin(['Female'])] [['Name', 'Score']]

         Name  Score
0     Rukayat     98
2    Ifeoluwa     99
3  Boluwatife     87
4     Omolola     90
5    Olubunmi     83